Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/supc.h
#define   SUPC_SR_WKUPIS7_EN_Val              _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS7_DIS                   (SUPC_SR_WKUPIS7_DIS_Val << SUPC_SR_WKUPIS7_Pos)     /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS7_EN                    (SUPC_SR_WKUPIS7_EN_Val << SUPC_SR_WKUPIS7_Pos)      /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS8_Pos                   _UINT32_(24)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS8_Msk                   (_UINT32_(0x1) << SUPC_SR_WKUPIS8_Pos)               /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS8(value)                (SUPC_SR_WKUPIS8_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS8_Pos)) /* Assignment of value for WKUPIS8 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS8_DIS_Val             _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS8_EN_Val              _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS8_DIS                   (SUPC_SR_WKUPIS8_DIS_Val << SUPC_SR_WKUPIS8_Pos)     /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS8_EN                    (SUPC_SR_WKUPIS8_EN_Val << SUPC_SR_WKUPIS8_Pos)      /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS9_Pos                   _UINT32_(25)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS9_Msk                   (_UINT32_(0x1) << SUPC_SR_WKUPIS9_Pos)               /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS9(value)                (SUPC_SR_WKUPIS9_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS9_Pos)) /* Assignment of value for WKUPIS9 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS9_DIS_Val             _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS9_EN_Val              _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS9_DIS                   (SUPC_SR_WKUPIS9_DIS_Val << SUPC_SR_WKUPIS9_Pos)     /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS9_EN                    (SUPC_SR_WKUPIS9_EN_Val << SUPC_SR_WKUPIS9_Pos)      /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS10_Pos                  _UINT32_(26)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS10_Msk                  (_UINT32_(0x1) << SUPC_SR_WKUPIS10_Pos)              /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS10(value)               (SUPC_SR_WKUPIS10_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS10_Pos)) /* Assignment of value for WKUPIS10 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS10_DIS_Val            _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS10_EN_Val             _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS10_DIS                  (SUPC_SR_WKUPIS10_DIS_Val << SUPC_SR_WKUPIS10_Pos)   /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS10_EN                   (SUPC_SR_WKUPIS10_EN_Val << SUPC_SR_WKUPIS10_Pos)    /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS11_Pos                  _UINT32_(27)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS11_Msk                  (_UINT32_(0x1) << SUPC_SR_WKUPIS11_Pos)              /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS11(value)               (SUPC_SR_WKUPIS11_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS11_Pos)) /* Assignment of value for WKUPIS11 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS11_DIS_Val            _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS11_EN_Val             _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS11_DIS                  (SUPC_SR_WKUPIS11_DIS_Val << SUPC_SR_WKUPIS11_Pos)   /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS11_EN                   (SUPC_SR_WKUPIS11_EN_Val << SUPC_SR_WKUPIS11_Pos)    /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS12_Pos                  _UINT32_(28)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS12_Msk                  (_UINT32_(0x1) << SUPC_SR_WKUPIS12_Pos)              /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS12(value)               (SUPC_SR_WKUPIS12_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS12_Pos)) /* Assignment of value for WKUPIS12 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS12_DIS_Val            _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS12_EN_Val             _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS12_DIS                  (SUPC_SR_WKUPIS12_DIS_Val << SUPC_SR_WKUPIS12_Pos)   /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS12_EN                   (SUPC_SR_WKUPIS12_EN_Val << SUPC_SR_WKUPIS12_Pos)    /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_WKUPIS13_Pos                  _UINT32_(29)                                         /* (SUPC_SR) WKUPx Input Status (cleared on read) Position */
#define SUPC_SR_WKUPIS13_Msk                  (_UINT32_(0x1) << SUPC_SR_WKUPIS13_Pos)              /* (SUPC_SR) WKUPx Input Status (cleared on read) Mask */
#define SUPC_SR_WKUPIS13(value)               (SUPC_SR_WKUPIS13_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS13_Pos)) /* Assignment of value for WKUPIS13 in the SUPC_SR register */
#define   SUPC_SR_WKUPIS13_DIS_Val            _UINT32_(0x0)                                        /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.  */
#define   SUPC_SR_WKUPIS13_EN_Val             _UINT32_(0x1)                                        /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.  */
#define SUPC_SR_WKUPIS13_DIS                  (SUPC_SR_WKUPIS13_DIS_Val << SUPC_SR_WKUPIS13_Pos)   /* (SUPC_SR) The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event. Position */
#define SUPC_SR_WKUPIS13_EN                   (SUPC_SR_WKUPIS13_EN_Val << SUPC_SR_WKUPIS13_Pos)    /* (SUPC_SR) The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR. Position */
#define SUPC_SR_Msk                           _UINT32_(0x3FFF60FE)                                 /* (SUPC_SR) Register Mask  */

#define SUPC_SR_LPDBCS_Pos                    _UINT32_(13)                                         /* (SUPC_SR Position) Low-power Debouncer Wake-up Status on WKUPx (cleared on read) */
#define SUPC_SR_LPDBCS_Msk                    (_UINT32_(0x3) << SUPC_SR_LPDBCS_Pos)                /* (SUPC_SR Mask) LPDBCS */
#define SUPC_SR_LPDBCS(value)                 (SUPC_SR_LPDBCS_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS_Pos)) 
#define SUPC_SR_WKUPIS_Pos                    _UINT32_(16)                                         /* (SUPC_SR Position) WKUPx Input Status (cleared on read) */
#define SUPC_SR_WKUPIS_Msk                    (_UINT32_(0x3FFF) << SUPC_SR_WKUPIS_Pos)             /* (SUPC_SR Mask) WKUPIS */
#define SUPC_SR_WKUPIS(value)                 (SUPC_SR_WKUPIS_Msk & (_UINT32_(value) << SUPC_SR_WKUPIS_Pos)) 

/* -------- SYSC_WPMR : (SUPC Offset: 0xD4) (R/W 32) Write Protection Mode Register -------- */
#define SYSC_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (SYSC_WPMR) Write Protection Enable Position */
#define SYSC_WPMR_WPEN_Msk                    (_UINT32_(0x1) << SYSC_WPMR_WPEN_Pos)                /* (SYSC_WPMR) Write Protection Enable Mask */
#define SYSC_WPMR_WPEN(value)                 (SYSC_WPMR_WPEN_Msk & (_UINT32_(value) << SYSC_WPMR_WPEN_Pos)) /* Assignment of value for WPEN in the SYSC_WPMR register */
#define SYSC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (SYSC_WPMR) Write Protection Key Position */
#define SYSC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << SYSC_WPMR_WPKEY_Pos)          /* (SYSC_WPMR) Write Protection Key Mask */
#define SYSC_WPMR_WPKEY(value)                (SYSC_WPMR_WPKEY_Msk & (_UINT32_(value) << SYSC_WPMR_WPKEY_Pos)) /* Assignment of value for WPKEY in the SYSC_WPMR register */
#define   SYSC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x525443)                                   /* (SYSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SYSC_WPMR_WPKEY_PASSWD                (SYSC_WPMR_WPKEY_PASSWD_Val << SYSC_WPMR_WPKEY_Pos)  /* (SYSC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position */
#define SYSC_WPMR_Msk                         _UINT32_(0xFFFFFF01)                                 /* (SYSC_WPMR) Register Mask  */


/* SUPC register offsets definitions */
#define SUPC_CR_REG_OFST               _UINT32_(0x00)      /* (SUPC_CR) Supply Controller Control Register Offset */
#define SUPC_SMMR_REG_OFST             _UINT32_(0x04)      /* (SUPC_SMMR) Supply Controller Supply Monitor Mode Register Offset */
#define SUPC_MR_REG_OFST               _UINT32_(0x08)      /* (SUPC_MR) Supply Controller Mode Register Offset */
#define SUPC_WUMR_REG_OFST             _UINT32_(0x0C)      /* (SUPC_WUMR) Supply Controller Wake-up Mode Register Offset */
#define SUPC_WUIR_REG_OFST             _UINT32_(0x10)      /* (SUPC_WUIR) Supply Controller Wake-up Inputs Register Offset */
#define SUPC_SR_REG_OFST               _UINT32_(0x14)      /* (SUPC_SR) Supply Controller Status Register Offset */
#define SYSC_WPMR_REG_OFST             _UINT32_(0xD4)      /* (SYSC_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SUPC register API structure */
typedef struct
{
  __O   uint32_t                       SUPC_CR;            /* Offset: 0x00 ( /W  32) Supply Controller Control Register */
  __IO  uint32_t                       SUPC_SMMR;          /* Offset: 0x04 (R/W  32) Supply Controller Supply Monitor Mode Register */
  __IO  uint32_t                       SUPC_MR;            /* Offset: 0x08 (R/W  32) Supply Controller Mode Register */
  __IO  uint32_t                       SUPC_WUMR;          /* Offset: 0x0C (R/W  32) Supply Controller Wake-up Mode Register */
  __IO  uint32_t                       SUPC_WUIR;          /* Offset: 0x10 (R/W  32) Supply Controller Wake-up Inputs Register */
  __I   uint32_t                       SUPC_SR;            /* Offset: 0x14 (R/   32) Supply Controller Status Register */
  __I   uint8_t                        Reserved1[0xBC];
  __IO  uint32_t                       SYSC_WPMR;          /* Offset: 0xD4 (R/W  32) Write Protection Mode Register */
} supc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA70_SUPC_COMPONENT_H_ */
